<?php

// 6. Создайте переменную $text и присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной на экран (DONE).

$text = 'Привет, Мир!';
echo $text;


// 7. Создайте переменные $text1='Привет, ' и $text2='Мир!'. С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!' (DONE).

$text1 = 'Привет, ';
$text2 = 'Мир!';
echo $text1 . $text2;


// 8. Создайте переменную $name и присвойте ей ваше имя. Выведите на экран фразу 'Привет, %Имя%!' (DONE).

$name = 'Павел';
echo 'Привет, ' . $name . '!';


// 9. Создайте переменную $age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!' (DONE).

$age = 38;
echo 'Мне ' . 38 . ' лет!'

// Part2 Working With Strings (DONE).

?>