<?php

// 1. Создайте переменную $a и присвойте ей значение 3. Выведите значение этой переменной на экран (DONE).

$a = 3;
echo $a;

// 2. Создайте переменные $a=10 и $b=2. Выведите на экран их сумму, разность,произведение и частное (результат деления) (DONE).

$a = 10;
$b = 2;

// Сумма:
$sum = $a + $b;

// Разность:
$difference = $a - $b;

//Произведение:
$work = $a * $b;

// Частное:
$private = $a / $b;

echo "Сумма: $sum.<br/>";
echo "Разность: $difference.<br/>";
echo "Произведение: $work.<br/>";
echo "Частное: $private.";

// 3. Создайте переменные $c=15 и $d=2. Просуммируйте их, а результат присвойтепеременной $result. Выведите на экран значение переменной $result (DONE).

$c = 15;
$d = 2;

$result = $c + $d;
echo "Сумма чисел равна: $result.";

// 4. Создайте переменные $a=10, $b=2 и $c=5. Выведите на экран их сумму(DONE).

$a = 10;
$b = 2;
$c = 5;

echo "Сумма трех чисел равна: " + $a + $b + $c + ".";

// 5. Создайте переменные $a=17 и $b=10. Отнимите от $a переменную $b и результат присвойте переменной $с. Затем создайте переменную $d, присвойте ей значение 7.Сложите переменные $c и $d, а результат запишите в переменную $result.Выведите на экран значение переменной $result.

$a = 17;
$b = 10;

$c = $a - $b;

$d = 7;

$result = $c + $d;
echo "Результат: $result.";

// Part1 Working with variables (DONE).

?>
